/*
 * QEMU LSI LOGIC LSI53C1030, SAS1068 and SAS1068e Host Bus Adapter emulation
 * Based on the QEMU Megasas emulator and the VirtualBox LsiLogic
 * LSI53c1030 SCSI controller
 *
 * Copyright (C) 2006-2009 Oracle Corporation
 * Copyright (c) 2009-2012 Hannes Reinecke, SUSE Labs
 * Copyright (C) 2012 Verizon Corporation
 *
 * This file is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License Version 2 (GPLv2)
 * as published by the Free Software Foundation.

 * This file is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details. <http://www.gnu.org/licenses/>.
 */

/*
 * Technical Manual
 * http://www.lsi.com/downloads/Public/Obsolete/Obsolete%20Common%20Files/1030_tm.pdf
 *
 * LSI Fusion-MPT Architecture
 * http://www.lsi.com/downloads/Public/Obsolete/Obsolete%20Common%20Files/fusion.pdf
 *
 */

#include "hw.h"
#include "pci.h"
#include "dma.h"
#include "msi.h"
#include "msix.h"
#include "iov.h"
#include "scsi.h"
#include "scsi-defs.h"
#include "block_int.h"
#include "trace.h"

#define MPTSCSI_REQUEST_QUEUE_DEPTH_DEFAULT 128
#define MPTSCSI_REPLY_QUEUE_DEPTH_DEFAULT   128

#define MPTSCSI_MAXIMUM_CHAIN_DEPTH 0x22

#define USE_PCIE
/* #define USE_MSIX */ /* curent theory is that this chip doesn't do msi-x */

/** SPI SCSI controller (LSI53C1030) */
#define MPTSCSI_PCI_SPI_CTRLNAME             "lsi53c1030"
#define MPTSCSI_PCI_SPI_DESC \
    "LSI Logic PCI-X Fusion-MPT SCSI Host Bus Adapter"
#define MPTSCSI_PCI_SPI_REVISION_ID          (0x00)
#define MPTSCSI_PCI_SPI_CLASS_CODE           (0x01)
#define MPTSCSI_PCI_SPI_SUBSYSTEM_ID         (0x8000)
#define MPTSCSI_PCI_SPI_PORTS_MAX            1
#define MPTSCSI_PCI_SPI_BUSES_MAX            1
#define MPTSCSI_PCI_SPI_DEVICES_PER_BUS_MAX  16
#define MPTSCSI_PCI_SPI_DEVICES_MAX \
    (MPTSCSI_PCI_SPI_BUSES_MAX*MPTSCSI_PCI_SPI_DEVICES_PER_BUS_MAX)

/** SAS SCSI controller (SAS1068 PCI-X Fusion-MPT SAS) */
#define MPTSCSI_PCI_SAS_CTRLNAME             "sas1068"
#define MPTSCSI_PCI_SAS_DESC \
    "LSI Logic PCI-X Fusion-MPT SAS Host Bus Adapter"
#define MPTSCSI_PCI_SAS_REVISION_ID          (0x00)
#define MPTSCSI_PCI_SAS_CLASS_CODE           (0x00)
#define MPTSCSI_PCI_SAS_SUBSYSTEM_ID         (0x8000)
#define MPTSCSI_PCI_SAS_PORTS_MAX             256
#define MPTSCSI_PCI_SAS_PORTS_DEFAULT           8
#define MPTSCSI_PCI_SAS_DEVICES_PER_PORT_MAX    1
#define MPTSCSI_PCI_SAS_DEVICES_MAX \
    (MPTSCSI_PCI_SAS_PORTS_MAX*MPTSCSI_PCI_SAS_DEVICES_PER_PORT_MAX)

/** SAS SCSI controller (SAS1068E PCI-Express Fusion-MPT SAS) */
#define MPTSCSI_PCI_SAS_E_CTRLNAME             "sas1068e"
#define MPTSCSI_PCI_SAS_E_DESC \
    "LSI Logic PCI-Express Fusion-MPT SAS Host Bus Adapter"
#define MPTSCSI_PCI_SAS_E_SUBSYSTEM_ID         (0x8000)
#define MPTSCSI_PCI_SAS_E_PORTS_MAX             256
#define MPTSCSI_PCI_SAS_E_PORTS_DEFAULT         128
#define MPTSCSI_PCI_SAS_E_DEVICES_PER_PORT_MAX    1
#define MPTSCSI_PCI_SAS_E_DEVICES_MAX \
    (MPTSCSI_PCI_SAS_E_PORTS_MAX*MPTSCSI_PCI_SAS_E_DEVICES_PER_PORT_MAX)

/**
 * A SAS address.
 */
typedef union QEMU_PACKED SASADDRESS {
    /** 64bit view. */
    uint64_t    ll_address;
    /** 32bit view. */
    uint32_t    l_address[2];
    /** 16bit view. */
    uint16_t    s_address[4];
    /** Byte view. */
    uint8_t     b_address[8];
} SASADDRESS, *PSASADDRESS;

/**
 * Possible device types we support.
 */
typedef enum MPTCTRLTYPE {
    /** SPI SCSI controller (PCI dev id 0x0030) */
    MPTCTRLTYPE_SCSI_SPI = 0,
    /** SAS SCSI controller (PCI dev id 0x0054 & 0x0058) */
    MPTCTRLTYPE_SCSI_SAS = 1,
    /** 32bit hack */
    MPTCTRLTYPE_32BIT_HACK = 0x7fffffff
} MPTCTRLTYPE, *PMPTCTRLTYPE;

/**
 * A simple SG element for a 64bit address.
 */
typedef struct QEMU_PACKED MptSGEntrySimple64 {
    /** Length of the buffer this entry describes. */
    unsigned length:24;
    /** Flag whether this element is the end of the list. */
    unsigned end_of_list:1;
    /** Flag whether the address is 32bit or 64bits wide. */
    unsigned bit_address:1;
    /** Flag whether this buffer contains data to be transferred or
        is the destination. */
    unsigned buffer_contains_data:1;
    /** Flag whether this is a local address or a system address. */
    unsigned local_address:1;
    /** Element type. */
    unsigned element_type:2;
    /** Flag whether this is the last element of the buffer. */
    unsigned end_of_buffer:1;
    /** Flag whether this is the last element of the current segment. */
    unsigned last_element:1;
    /** Lower 32bits of the address of the data buffer. */
    uint32_t data_buf_addr_low;
    /** Upper 32bits of the address of the data buffer. */
    uint32_t data_buf_addr_high;
} MptSGEntrySimple64, *PMptSGEntrySimple64;

/**
 * A simple SG element for a 32bit address.
 */
typedef struct QEMU_PACKED MptSGEntrySimple32 {
    /** Length of the buffer this entry describes. */
    unsigned length:24;
    /** Flag whether this element is the end of the list. */
    unsigned end_of_list:1;
    /** Flag whether the address is 32bit or 64bits wide. */
    unsigned bit_address:1;
    /** Flag whether this buffer contains data to be transferred
        or is the destination. */
    unsigned buffer_contains_data:1;
    /** Flag whether this is a local address or a system address. */
    unsigned local_address:1;
    /** Element type. */
    unsigned element_type:2;
    /** Flag whether this is the last element of the buffer. */
    unsigned end_of_buffer:1;
    /** Flag whether this is the last element of the current segment. */
    unsigned last_element:1;
    /** Lower 32bits of the address of the data buffer. */
    uint32_t data_buf_addr_low;
} MptSGEntrySimple32, *PMptSGEntrySimple32;

/**
 * A chain SG element.
 */
typedef struct QEMU_PACKED MptSGEntryChain {
    /** Size of the segment. */
    uint16_t length;
    /** Offset in 32bit words of the next chain element in the segment
     *  identified by this element. */
    uint8_t next_chain_offset;
    /** Reserved. */
    unsigned reserved0:1;
    /** Flag whether the address is 32bit or 64bits wide. */
    unsigned bit_address:1;
    /** Reserved. */
    unsigned reserved1:1;
    /** Flag whether this is a local address or a system address. */
    unsigned local_address:1;
    /** Element type. */
    unsigned element_type:2;
    /** Flag whether this is the last element of the buffer. */
    unsigned reserved2:2;
    /** Lower 32bits of the address of the data buffer. */
    uint32_t segment_address_low;
    /** Upper 32bits of the address of the data buffer. */
    uint32_t segment_address_high;
} MptSGEntryChain, *PMptSGEntryChain;

typedef union MptSGEntryUnion {
    MptSGEntrySimple64 simple_64;
    MptSGEntrySimple32 simple_32;
    MptSGEntryChain    chain;
} MptSGEntryUnion, *PMptSGEntryUnion;

/**
 * MPT Fusion message header - Common for all message frames.
 * This is filled in by the guest.
 */
typedef struct QEMU_PACKED MptMessageHdr {
    /** Function dependent data. */
    uint16_t    function_dependent;
    /** Chain offset. */
    uint8_t     chain_offset;
    /** The function code. */
    uint8_t     function;
    /** Function dependent data. */
    uint8_t     function_dependent_data[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context - Unique ID from the guest unmodified by the device. */
    uint32_t    message_context;
} MptMessageHdr, *PMptMessageHdr;

/** Defined function codes found in the message header. */
#define MPT_MESSAGE_HDR_FUNCTION_SCSI_IO_REQUEST        (0x00)
#define MPT_MESSAGE_HDR_FUNCTION_SCSI_TASK_MGMT         (0x01)
#define MPT_MESSAGE_HDR_FUNCTION_IOC_INIT               (0x02)
#define MPT_MESSAGE_HDR_FUNCTION_IOC_FACTS              (0x03)
#define MPT_MESSAGE_HDR_FUNCTION_CONFIG                 (0x04)
#define MPT_MESSAGE_HDR_FUNCTION_PORT_FACTS             (0x05)
#define MPT_MESSAGE_HDR_FUNCTION_PORT_ENABLE            (0x06)
#define MPT_MESSAGE_HDR_FUNCTION_EVENT_NOTIFICATION     (0x07)
#define MPT_MESSAGE_HDR_FUNCTION_EVENT_ACK              (0x08)
#define MPT_MESSAGE_HDR_FUNCTION_FW_DOWNLOAD            (0x09)
#define MPT_MESSAGE_HDR_FUNCTION_TARGET_CMD_BUFFER_POST (0x0A)
#define MPT_MESSAGE_HDR_FUNCTION_TARGET_ASSIST          (0x0B)
#define MPT_MESSAGE_HDR_FUNCTION_TARGET_STATUS_SEND     (0x0C)
#define MPT_MESSAGE_HDR_FUNCTION_TARGET_MODE_ABORT      (0x0D)
#define MPT_MESSAGE_HDR_FUNCTION_FW_UPLOAD              (0x12)

/**
 * Default reply message.
 * Send from the device to the guest upon completion of a request.
 */
typedef struct QEMU_PACKED MptDefaultReplyMessage {
    /** Function dependent data. */
    uint16_t    function_dependent;
    /** Length of the message in 32bit DWords. */
    uint8_t     message_length;
    /** Function which completed. */
    uint8_t     function;
    /** Function dependent. */
    uint8_t     function_dependent_data[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context given in the request. */
    uint32_t    message_context;
    /** Function dependent status code. */
    uint16_t    function_dependentStatus;
    /** Status of the IOC. */
    uint16_t    ioc_status;
    /** Additional log info. */
    uint32_t    ioc_log_info;
} MptDefaultReplyMessage, *PMptDefaultReplyMessage;

/**
 * IO controller init request.
 */
typedef struct QEMU_PACKED MptIOCInitRequest {
    /** Which system send this init request. */
    uint8_t     who_init;
    /** Reserved */
    uint8_t     reserved;
    /** Chain offset in the SG list. */
    uint8_t     chain_offset;
    /** Function to execute. */
    uint8_t     function;
    /** Flags */
    uint8_t     flags;
    /** Maximum number of devices the driver can handle. */
    uint8_t     max_devices;
    /** Maximum number of buses the driver can handle. */
    uint8_t     max_buses;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** Reply frame size. */
    uint16_t    reply_frame_size;
    /** Reserved */
    uint16_t    reserved1;
    /** Upper 32bit part of the 64bit address the message frames are in.
     *  That means all frames must be in the same 4GB segment. */
    uint32_t    host_mfa_high_addr;
    /** Upper 32bit of the sense buffer. */
    uint32_t    sense_buffer_high_addr;
} MptIOCInitRequest, *PMptIOCInitRequest;

/**
 * IO controller init reply.
 */
typedef struct QEMU_PACKED MptIOCInitReply {
    /** Which subsystem send this init request. */
    uint8_t     who_init;
    /** Reserved */
    uint8_t     reserved;
    /** Message length */
    uint8_t     message_length;
    /** Function. */
    uint8_t     function;
    /** Flags */
    uint8_t     flags;
    /** Maximum number of devices the driver can handle. */
    uint8_t     max_devices;
    /** Maximum number of busses the driver can handle. */
    uint8_t     max_buses;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID */
    uint32_t    message_context;
    /** Reserved */
    uint16_t    reserved1;
    /** IO controller status. */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
} MptIOCInitReply, *PMptIOCInitReply;

/**
 * IO controller facts request.
 */
typedef struct QEMU_PACKED MptIOCFactsRequest {
    /** Reserved. */
    uint16_t    reserved;
    /** Chain offset in SG list. */
    uint8_t     chain_offset;
    /** Function number. */
    uint8_t     function;
    /** Reserved */
    uint8_t     reserved1[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
} MptIOCFactsRequest, *PMptIOCFactsRequest;

/**
 * IO controller facts reply.
 */
typedef struct QEMU_PACKED MptIOCFactsReply {
    /** Message version. */
    uint16_t    message_version;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved */
    uint16_t    reserved1;
    /** IO controller number */
    uint8_t     ioc_number;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** IO controller exceptions */
    uint16_t    ioc_exceptions;
    /** IO controller status. */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
    /** Maximum chain depth. */
    uint8_t     max_chain_depth;
    /** The current value of the WhoInit field. */
    uint8_t     who_init;
    /** Block size. */
    uint8_t     block_size;
    /** Flags. */
    uint8_t     flags;
    /** Depth of the reply queue. */
    uint16_t    reply_queue_depth;
    /** Size of a request frame. */
    uint16_t    request_frame_size;
    /** Reserved */
    uint16_t    reserved2;
    /** Product ID. */
    uint16_t    product_id;
    /** Current value of the high 32bit MFA address. */
    uint32_t    current_host_mfa_high_addr;
    /** Global credits - Number of entries allocated to queues */
    uint16_t    global_credits;
    /** Number of ports on the IO controller */
    uint8_t     number_of_ports;
    /** Event state. */
    uint8_t     event_state;
    /** Current value of the high 32bit sense buffer address. */
    uint32_t    current_sense_buffer_high_addr;
    /** Current reply frame size. */
    uint16_t    cur_reply_frame_size;
    /** Maximum number of devices. */
    uint8_t     max_devices;
    /** Maximum number of buses. */
    uint8_t     max_buses;
    /** Size of the firmware image. */
    uint32_t    fw_image_size;
    /** Reserved. */
    uint32_t    reserved;
    /** Firmware version */
    uint32_t    fw_version;
} MptIOCFactsReply, *PMptIOCFactsReply;

/**
 * Port facts request
 */
typedef struct QEMU_PACKED MptPortFactsRequest {
    /** Reserved */
    uint16_t    reserved1;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved */
    uint16_t    reserved2;
    /** Port number to get facts for. */
    uint8_t     port_number;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
} MptPortFactsRequest, *PMptPortFactsRequest;

/**
 * Port facts reply.
 */
typedef struct QEMU_PACKED MptPortFactsReply {
    /** Reserved. */
    uint16_t    reserved1;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved */
    uint16_t    reserved2;
    /** Port number the facts are for. */
    uint8_t     port_number;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** Reserved. */
    uint16_t    reserved3;
    /** IO controller status. */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
    /** Reserved */
    uint8_t     reserved;
    /** Port type */
    uint8_t     port_type;
    /** Maximum number of devices on this port. */
    uint16_t    max_devices;
    /** SCSI ID of this port on the attached bus. */
    uint16_t    port_scsi_id;
    /** Protocol flags. */
    uint16_t    protocol_flags;
    /** Maximum number of target command buffers which can be
        posted to this port at a time. */
    uint16_t    max_posted_cmd_buffers;
    /** Maximum number of target IDs that remain persistent
        between power/reset cycles. */
    uint16_t    max_persistent_ids;
    /** Maximum number of LAN buckets. */
    uint16_t    max_lan_buckets;
    /** Reserved. */
    uint16_t    reserved4;
    /** Reserved. */
    uint32_t    reserved5;
} MptPortFactsReply, *PMptPortFactsReply;

/**
 * Port Enable request.
 */
typedef struct QEMU_PACKED MptPortEnableRequest {
    /** Reserved. */
    uint16_t    reserved1;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved. */
    uint16_t    reserved2;
    /** Port number to enable. */
    uint8_t     port_number;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
} MptPortEnableRequest, *PMptPortEnableRequest;

/**
 * Port enable reply.
 */
typedef struct QEMU_PACKED MptPortEnableReply {
    /** Reserved. */
    uint16_t    reserved1;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved */
    uint16_t    reserved2;
    /** Port number which was enabled. */
    uint8_t     port_number;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** Reserved. */
    uint16_t    reserved3;
    /** IO controller status */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
} MptPortEnableReply, *PMptPortEnableReply;

/**
 * Event notification request.
 */
typedef struct QEMU_PACKED MptEventNotificationRequest {
    /** Switch - Turns event notification on and off. */
    uint8_t     event_switch;
    /** Reserved. */
    uint8_t     reserved1;
    /** Chain offset. */
    uint8_t     chain_offset;
    /** Function number. */
    uint8_t     function;
    /** Reserved. */
    uint8_t     reserved2[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
} MptEventNotificationRequest, *PMptEventNotificationRequest;

/**
 * Event notification reply.
 */
typedef struct QEMU_PACKED MptEventNotificationReply {
    /** Event data length. */
    uint16_t    event_data_length;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved. */
    uint16_t    reserved1;
    /** Ack required. */
    uint8_t     ack_required;
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** Reserved. */
    uint16_t    reserved2;
    /** IO controller status. */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
    /** Notification event. */
    uint32_t    event;
    /** Event context. */
    uint32_t    event_context;
    /** Event data. */
    uint32_t    event_data;
} MptEventNotificationReply, *PMptEventNotificationReply;

#define MPT_EVENT_EVENT_CHANGE (0x0000000a)

/**
 * FW download request.
 */
typedef struct QEMU_PACKED MptFWDownloadRequest {
    /** Switch - Turns event notification on and off. */
    uint8_t     image_type;
    /** Reserved. */
    uint8_t     reserved1;
    /** Chain offset. */
    uint8_t     chain_offset;
    /** Function number. */
    uint8_t     function;
    /** Reserved. */
    uint8_t     reserved2[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
} MptFWDownloadRequest, *PMptFWDownloadRequest;

#define MPT_FW_DOWNLOAD_REQUEST_IMAGE_TYPE_RESERVED 0
#define MPT_FW_DOWNLOAD_REQUEST_IMAGE_TYPE_FIRMWARE 1
#define MPT_FW_DOWNLOAD_REQUEST_IMAGE_TYPE_MPI_BIOS 2
#define MPT_FW_DOWNLOAD_REQUEST_IMAGE_TYPE_NVDATA   3

/**
 * FW download reply.
 */
typedef struct QEMU_PACKED MptFWDownloadReply {
    /** Reserved. */
    uint16_t    reserved1;
    /** Message length. */
    uint8_t     message_length;
    /** Function number. */
    uint8_t     function;
    /** Reserved. */
    uint8_t     reserved2[3];
    /** Message flags. */
    uint8_t     message_flags;
    /** Message context ID. */
    uint32_t    message_context;
    /** Reserved. */
    uint16_t    reserved3;
    /** IO controller status. */
    uint16_t    ioc_status;
    /** IO controller log information. */
    uint32_t    ioc_log_info;
} MptFWDownloadReply, *PMptFWDownloadReply;

typedef struct QEMU_PACKED MptFwHeader {
    uint32_t    arm_branch_instruction_0;   /* 00h */
    uint32_t    signature_0;                /* 04h */
    uint32_t    signature_1;                /* 08h */
    uint32_t    signature_2;                /* 0Ch */
    uint32_t    arm_branch_instruction_1;   /* 10h */
    uint32_t    arm_branch_instruction_2;   /* 14h */
    uint32_t    reserved;                   /* 18h */
    uint32_t    checksum;                   /* 1Ch */
    uint16_t    vendor_id;                  /* 20h */
    uint16_t    product_id;                 /* 22h */
    uint32_t    fw_version;                 /* 24h */
    uint32_t    seq_code_version;           /* 28h */
    uint32_t    image_size;                 /* 2Ch */
    uint32_t    next_image_header_offset;   /* 30h */
    uint32_t    load_start_address;         /* 34h */
    uint32_t    iop_reset_vector_value;     /* 38h */
    uint32_t    iop_reset_reg_addr;         /* 3Ch */
    uint32_t    version_name_what;          /* 40h */
    uint8_t     version_name[32];           /* 44h */
    uint32_t    vendor_name_what;           /* 64h */
    uint8_t     vendor_name[32];            /* 68h */
} MptFwHeader_t, *pMptFwHeader_t;

typedef struct QEMU_PACKED MptFWUploadTCSGE {
    uint8_t      reserved;                  /* 00h */
    uint8_t      context_size;              /* 01h */
    uint8_t      details_length;            /* 02h */
    uint8_t      flags;                     /* 03h */
    uint32_t     reserved1;                 /* 04h */
    uint32_t     image_offset;              /* 08h */
    uint32_t     image_size;                /* 0Ch */
} MptFWUploadTCSGE_t, *pMptFWUploadTCSGE_t;

#define MPI_FW_UPLOAD_ITYPE_FW_IOC_MEM          (0x00)
#define MPI_FW_UPLOAD_ITYPE_FW_FLASH            (0x01)
#define MPI_FW_UPLOAD_ITYPE_BIOS_FLASH          (0x02)
#define MPI_FW_UPLOAD_ITYPE_NVDATA              (0x03)
#define MPI_FW_UPLOAD_ITYPE_BOOTLOADER          (0x04)
#define MPI_FW_UPLOAD_ITYPE_FW_BACKUP           (0x05)
#define MPI_FW_UPLOAD_ITYPE_MANUFACTURING       (0x06)
#define MPI_FW_UPLOAD_ITYPE_CONFIG_1            (0x07)
#define MPI_FW_UPLOAD_ITYPE_CONFIG_2            (0x08)
#define MPI_FW_UPLOAD_ITYPE_MEGARAID            (0x09)
#define MPI_FW_UPLOAD_ITYPE_COMPLETE            (0x0A)
#define MPI_FW_UPLOAD_ITYPE_COMMON_BOOT_BLOCK   (0x0B)

/**
 * FW upload request.
 */
typedef struct QEMU_PACKED MptFWUploadRequest {
    /** Requested image type. */
    uint8_t     image_type;
    /** Reserved. */
    uint8_t     reserved1;
    /** Chain offset. */
